grevaillot/svd_tools/headers/STM32G474xx/hrtim_tima.h
/** HRTIM_TIMA_CPT2ACR_TECMP2 Timer E Compare 2 **/
#define HRTIM_TIMA_CPT2ACR_TECMP2		(1 << 31)
/** HRTIM_TIMA_CPT2ACR_TECMP1 Timer E Compare 1 **/
#define HRTIM_TIMA_CPT2ACR_TECMP1		(1 << 30)
/** HRTIM_TIMA_CPT2ACR_TE1RST Timer E output 1 Reset **/
#define HRTIM_TIMA_CPT2ACR_TE1RST		(1 << 29)
/** HRTIM_TIMA_CPT2ACR_TE1SET Timer E output 1 Set **/
#define HRTIM_TIMA_CPT2ACR_TE1SET		(1 << 28)
/** HRTIM_TIMA_CPT2ACR_TDCMP2 Timer D Compare 2 **/
#define HRTIM_TIMA_CPT2ACR_TDCMP2		(1 << 27)
/** HRTIM_TIMA_CPT2ACR_TDCMP1 Timer D Compare 1 **/
#define HRTIM_TIMA_CPT2ACR_TDCMP1		(1 << 26)
/** HRTIM_TIMA_CPT2ACR_TD1RST Timer D output 1 Reset **/
#define HRTIM_TIMA_CPT2ACR_TD1RST		(1 << 25)
/** HRTIM_TIMA_CPT2ACR_TD1SET Timer D output 1 Set **/
#define HRTIM_TIMA_CPT2ACR_TD1SET		(1 << 24)
/** HRTIM_TIMA_CPT2ACR_TCCMP2 Timer C Compare 2 **/
#define HRTIM_TIMA_CPT2ACR_TCCMP2		(1 << 23)
/** HRTIM_TIMA_CPT2ACR_TCCMP1 Timer C Compare 1 **/
#define HRTIM_TIMA_CPT2ACR_TCCMP1		(1 << 22)
/** HRTIM_TIMA_CPT2ACR_TC1RST Timer C output 1 Reset **/
#define HRTIM_TIMA_CPT2ACR_TC1RST		(1 << 21)
/** HRTIM_TIMA_CPT2ACR_TC1SET Timer C output 1 Set **/
#define HRTIM_TIMA_CPT2ACR_TC1SET		(1 << 20)
/** HRTIM_TIMA_CPT2ACR_TBCMP2 Timer B Compare 2 **/
#define HRTIM_TIMA_CPT2ACR_TBCMP2		(1 << 19)
/** HRTIM_TIMA_CPT2ACR_TBCMP1 Timer B Compare 1 **/
#define HRTIM_TIMA_CPT2ACR_TBCMP1		(1 << 18)
/** HRTIM_TIMA_CPT2ACR_TB1RST Timer B output 1 Reset **/
#define HRTIM_TIMA_CPT2ACR_TB1RST		(1 << 17)
/** HRTIM_TIMA_CPT2ACR_TB1SET Timer B output 1 Set **/
#define HRTIM_TIMA_CPT2ACR_TB1SET		(1 << 16)
/** HRTIM_TIMA_CPT2ACR_TFCMP2 TFCMP2 **/
#define HRTIM_TIMA_CPT2ACR_TFCMP2		(1 << 15)
/** HRTIM_TIMA_CPT2ACR_TFCMP1 TFCMP1 **/
#define HRTIM_TIMA_CPT2ACR_TFCMP1		(1 << 14)
/** HRTIM_TIMA_CPT2ACR_TF1RST TF1RST **/
#define HRTIM_TIMA_CPT2ACR_TF1RST		(1 << 13)
/** HRTIM_TIMA_CPT2ACR_TF1SET TF1SET **/
#define HRTIM_TIMA_CPT2ACR_TF1SET		(1 << 12)
/** HRTIM_TIMA_CPT2ACR_EXEV10CPT External Event 10 Capture **/
#define HRTIM_TIMA_CPT2ACR_EXEV10CPT		(1 << 11)
/** HRTIM_TIMA_CPT2ACR_EXEV9CPT External Event 9 Capture **/
#define HRTIM_TIMA_CPT2ACR_EXEV9CPT		(1 << 10)
/** HRTIM_TIMA_CPT2ACR_EXEV8CPT External Event 8 Capture **/
#define HRTIM_TIMA_CPT2ACR_EXEV8CPT		(1 << 9)
/** HRTIM_TIMA_CPT2ACR_EXEV7CPT External Event 7 Capture **/
#define HRTIM_TIMA_CPT2ACR_EXEV7CPT		(1 << 8)
/** HRTIM_TIMA_CPT2ACR_EXEV6CPT External Event 6 Capture **/
#define HRTIM_TIMA_CPT2ACR_EXEV6CPT		(1 << 7)
/** HRTIM_TIMA_CPT2ACR_EXEV5CPT External Event 5 Capture **/
#define HRTIM_TIMA_CPT2ACR_EXEV5CPT		(1 << 6)
/** HRTIM_TIMA_CPT2ACR_EXEV4CPT External Event 4 Capture **/
#define HRTIM_TIMA_CPT2ACR_EXEV4CPT		(1 << 5)
/** HRTIM_TIMA_CPT2ACR_EXEV3CPT External Event 3 Capture **/
#define HRTIM_TIMA_CPT2ACR_EXEV3CPT		(1 << 4)
/** HRTIM_TIMA_CPT2ACR_EXEV2CPT External Event 2 Capture **/
#define HRTIM_TIMA_CPT2ACR_EXEV2CPT		(1 << 3)
/** HRTIM_TIMA_CPT2ACR_EXEV1CPT External Event 1 Capture **/
#define HRTIM_TIMA_CPT2ACR_EXEV1CPT		(1 << 2)
/** HRTIM_TIMA_CPT2ACR_UDPCPT Update Capture **/
#define HRTIM_TIMA_CPT2ACR_UDPCPT		(1 << 1)
/** HRTIM_TIMA_CPT2ACR_SWCPT Software Capture **/
#define HRTIM_TIMA_CPT2ACR_SWCPT		(1 << 0)

/**@}*/

/** @defgroup hrtim_tima_outar OUTAR Timerx Output Register
@{*/

/** HRTIM_TIMA_OUTAR_DIDL2 Output 2 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIMA_OUTAR_DIDL2		(1 << 23)
/** HRTIM_TIMA_OUTAR_CHP2 Output 2 Chopper enable **/
#define HRTIM_TIMA_OUTAR_CHP2		(1 << 22)

#define HRTIM_TIMA_OUTAR_FAULT2_SHIFT		20
#define HRTIM_TIMA_OUTAR_FAULT2_MASK		0x03
/** @defgroup hrtim_tima_outar_fault2 FAULT2 Output 2 Fault state
@{*/
/**@}*/

/** HRTIM_TIMA_OUTAR_IDLES2 Output 2 Idle State **/
#define HRTIM_TIMA_OUTAR_IDLES2		(1 << 19)
/** HRTIM_TIMA_OUTAR_IDLEM2 Output 2 Idle mode **/
#define HRTIM_TIMA_OUTAR_IDLEM2		(1 << 18)
/** HRTIM_TIMA_OUTAR_POL2 Output 2 polarity **/
#define HRTIM_TIMA_OUTAR_POL2		(1 << 17)
/** HRTIM_TIMA_OUTAR_BIAR Balanced Idle Automatic Resume **/
#define HRTIM_TIMA_OUTAR_BIAR		(1 << 14)

#define HRTIM_TIMA_OUTAR_DLYPRT_SHIFT		10
#define HRTIM_TIMA_OUTAR_DLYPRT_MASK		0x07
/** @defgroup hrtim_tima_outar_dlyprt DLYPRT Delayed Protection
@{*/
/**@}*/

/** HRTIM_TIMA_OUTAR_DLYPRTEN Delayed Protection Enable **/
#define HRTIM_TIMA_OUTAR_DLYPRTEN		(1 << 9)
/** HRTIM_TIMA_OUTAR_DTEN Deadtime enable **/
#define HRTIM_TIMA_OUTAR_DTEN		(1 << 8)
/** HRTIM_TIMA_OUTAR_DIDL1 Output 1 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIMA_OUTAR_DIDL1		(1 << 7)
/** HRTIM_TIMA_OUTAR_CHP1 Output 1 Chopper enable **/
#define HRTIM_TIMA_OUTAR_CHP1		(1 << 6)

#define HRTIM_TIMA_OUTAR_FAULT1_SHIFT		4
#define HRTIM_TIMA_OUTAR_FAULT1_MASK		0x03
/** @defgroup hrtim_tima_outar_fault1 FAULT1 Output 1 Fault state
@{*/
/**@}*/

/** HRTIM_TIMA_OUTAR_IDLES1 Output 1 Idle State **/
#define HRTIM_TIMA_OUTAR_IDLES1		(1 << 3)
/** HRTIM_TIMA_OUTAR_IDLEM1 Output 1 Idle mode **/
#define HRTIM_TIMA_OUTAR_IDLEM1		(1 << 2)
/** HRTIM_TIMA_OUTAR_POL1 Output 1 polarity **/
#define HRTIM_TIMA_OUTAR_POL1		(1 << 1)

/**@}*/

/** @defgroup hrtim_tima_fltar FLTAR Timerx Fault Register
@{*/

/** HRTIM_TIMA_FLTAR_FLTLCK Fault sources Lock **/
#define HRTIM_TIMA_FLTAR_FLTLCK		(1 << 31)
/** HRTIM_TIMA_FLTAR_FLT6EN Fault 6 enable **/
#define HRTIM_TIMA_FLTAR_FLT6EN		(1 << 5)
/** HRTIM_TIMA_FLTAR_FLT5EN Fault 5 enable **/
#define HRTIM_TIMA_FLTAR_FLT5EN		(1 << 4)
/** HRTIM_TIMA_FLTAR_FLT4EN Fault 4 enable **/
#define HRTIM_TIMA_FLTAR_FLT4EN		(1 << 3)
/** HRTIM_TIMA_FLTAR_FLT3EN Fault 3 enable **/
#define HRTIM_TIMA_FLTAR_FLT3EN		(1 << 2)
/** HRTIM_TIMA_FLTAR_FLT2EN Fault 2 enable **/
#define HRTIM_TIMA_FLTAR_FLT2EN		(1 << 1)
/** HRTIM_TIMA_FLTAR_FLT1EN Fault 1 enable **/
#define HRTIM_TIMA_FLTAR_FLT1EN		(1 << 0)

/**@}*/

/** @defgroup hrtim_tima_timacr2 TIMACR2 HRTIM Timerx Control Register 2
@{*/

/** HRTIM_TIMA_TIMACR2_TRGHLF Triggered-half mode **/
#define HRTIM_TIMA_TIMACR2_TRGHLF		(1 << 20)
/** HRTIM_TIMA_TIMACR2_GTCMP3 Greater than Compare 3 PWM mode **/
#define HRTIM_TIMA_TIMACR2_GTCMP3		(1 << 17)
/** HRTIM_TIMA_TIMACR2_GTCMP1 Greater than Compare 1 PWM mode **/
#define HRTIM_TIMA_TIMACR2_GTCMP1		(1 << 16)

#define HRTIM_TIMA_TIMACR2_FEROM_SHIFT		14
#define HRTIM_TIMA_TIMACR2_FEROM_MASK		0x03
/** @defgroup hrtim_tima_timacr2_ferom FEROM Fault and Event Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMA_TIMACR2_BMROM_SHIFT		12
#define HRTIM_TIMA_TIMACR2_BMROM_MASK		0x03
/** @defgroup hrtim_tima_timacr2_bmrom BMROM Burst Mode Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMA_TIMACR2_ADROM_SHIFT		10
#define HRTIM_TIMA_TIMACR2_ADROM_MASK		0x03
/** @defgroup hrtim_tima_timacr2_adrom ADROM ADC Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMA_TIMACR2_OUTROM_SHIFT		8
#define HRTIM_TIMA_TIMACR2_OUTROM_MASK		0x03
/** @defgroup hrtim_tima_timacr2_outrom OUTROM Output Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMA_TIMACR2_ROM_SHIFT		6
#define HRTIM_TIMA_TIMACR2_ROM_MASK		0x03
/** @defgroup hrtim_tima_timacr2_rom ROM Roll-Over Mode
@{*/
/**@}*/

/** HRTIM_TIMA_TIMACR2_UDM Up-Down Mode **/
#define HRTIM_TIMA_TIMACR2_UDM		(1 << 4)
/** HRTIM_TIMA_TIMACR2_DCDR Dual Channel DAC Reset trigger **/
#define HRTIM_TIMA_TIMACR2_DCDR		(1 << 2)
/** HRTIM_TIMA_TIMACR2_DCDS Dual Channel DAC Step trigger **/
#define HRTIM_TIMA_TIMACR2_DCDS		(1 << 1)
/** HRTIM_TIMA_TIMACR2_DCDE Dual Channel DAC trigger enable **/
#define HRTIM_TIMA_TIMACR2_DCDE		(1 << 0)

/**@}*/

/** @defgroup hrtim_tima_aeefr3 AEEFR3 HRTIM Timerx External Event Filtering Register 3
@{*/


#define HRTIM_TIMA_AEEFR3_EEVACNT_SHIFT		8
#define HRTIM_TIMA_AEEFR3_EEVACNT_MASK		0x3f
/** @defgroup hrtim_tima_aeefr3_eevacnt EEVACNT External Event A counter
@{*/
/**@}*/


#define HRTIM_TIMA_AEEFR3_EEVASEL_SHIFT		4
#define HRTIM_TIMA_AEEFR3_EEVASEL_MASK		0x0f
/** @defgroup hrtim_tima_aeefr3_eevasel EEVASEL External Event A Selection
@{*/
/**@}*/

/** HRTIM_TIMA_AEEFR3_EEVARSTM External Event A Reset Mode **/
#define HRTIM_TIMA_AEEFR3_EEVARSTM		(1 << 2)
/** HRTIM_TIMA_AEEFR3_EEVACRES External Event A Counter Reset **/
#define HRTIM_TIMA_AEEFR3_EEVACRES		(1 << 1)
/** HRTIM_TIMA_AEEFR3_EEVACE External Event A Counter Enable **/
#define HRTIM_TIMA_AEEFR3_EEVACE		(1 << 0)

/**@}*/
